---
kind: type
id: T:Autodesk.Revit.DB.Categories
source: html/6708af38-6a62-ead0-88ff-c68bedd88ffe.htm
---
# Autodesk.Revit.DB.Categories

The Categories object is a map that contains all the top-level Category objects within the Document.

## Syntax (C#)
```csharp
public class Categories : CategoryNameMap
```

## Remarks
Use this object to retrieve categories by name or by BuiltInCategory id.